<!doctype html>
<html lang="en">
<head>
<meta charset="UTF-8" />
<title>Document</title>
</head>
<body>
<p>
HTML 멀티미디어
웹상의 멀티미디어는 사운드, 음악, 비디오, 영화, 애니메이션입니다.

멀티미디어란?
멀티미디어는 다양한 형태로 제공됩니다.당신이 할 수 있는 거의 모든 것이 될 수 있다.듣거나 보거나 이미지, 음악,사운드, 비디오, 레코드, 영화, 애니메이션 등을 제공합니다.

웹 페이지에는 종종 다른 유형과 형식의 멀티미디어 요소가 포함되어 있습니다.

브라우저 지원
최초의 웹 브라우저는 텍스트만 지원했으며 단일 색상의 단일 글꼴로 제한되었습니다.

나중에 컬러, 폰트, 이미지, 멀티미디어를 지원하는 브라우저가 등장했습니다!

멀티미디어 포맷
멀티미디어 요소(오디오나 비디오 등)는 미디어 파일에 저장됩니다.

파일 형식을 검색하는 가장 일반적인 방법은 파일을 보는 것입니다.내선 번호

멀티미디어 파일은 형식과 확장자가 다릅니다.예를 들어 .vi, .mp3, .mp4, .mpg, .wmv 및 .avi 입니다.


<img src="common/img/htmlmedia.png" alt="" />
주의: HTML 표준에서는 MP4, WebM 및 Ogg 비디오만 지원됩니다.

일반적인 오디오 형식
MP3는 압축된 녹음된 음악에 가장 적합한 형식입니다.그MP3라는 용어는 디지털 음악과 동의어가 되었다.

만약 당신의 웹사이트가 녹음된 음악에 관한 것이라면 MP3를 선택할 수 있습니다.

<img src="common/img/htmlmedia2.png" alt="" />
주의: HTML 표준에서는 MP3, WAV 및 Ogg 오디오만 지원됩니다.

</p>
</body>
</html>